{
  "blogs": [
    {
      "title": "Mata",
      "author": "patryk",
      "body": "He is the son of Marcin Matczak, a law professor and Arletta Śliwińska-Matczak, who runs an English language school, both from Sława.[1] In 2019, he passed the international high school diploma at the Stefan Batory Lyceum in Warsaw.[2] During the exams, he presented, inter alia, essay titled \"Evolution of language in Polish hip-hop in 2001–2014 based on the work of Jacek Graniecki \"Tede\"\".[3] He received the award of the Varsovian of the Year 2019 in the Warszawiaki plebiscite.[4] The creator of his artistic pseudonym was his father, who invented it during their joint holidays in 2012. He supported his son in entering the music market and advised on the creation of the first song \"Klubowe\".[5][6]",
      "id": 2
    },
    {
      "title": "Que",
      "author": "jan",
      "body": "Kuba Grabowski (born 7 July 1991 in Ciechanów), better known by his stage name Quebonafide, is a Polish rapper, singer and songwriter. Member of the duos Yochimu and Taconafide. Founder of the record label QueQuality. With over 350 thousand albums sold, he is one of Poland's best-selling rappers. His biggest success thus far - the Soma 0.5 mg album, recorded with the rapper Taco Hemingway - has sold more than 150 thousand copies. Also his solo album Egzotyka proved successful, selling over 150 thousand copies. His albums have repeatedly won the status of platinum, gold and diamond records. The rapper has authored such hits as 'Candy', 'Bubbletea' or 'Tamagotchi'. Five-time nominee for the Fryderyk award, with one victory for Soma 0,5 mg[1] in the Hip-Hop Album of the Year category. In 2018, his album Egzotyka was nominated for Empik Bestseller award in the Polish Music category.[2]",
      "id": 3
    },
    {
      "title": "Taco Hemigway",
      "author": "patryk",
      "body": "Filip Szcześniak was born in Cairo, Egypt, in 1990.[2][3][4] At the age of 2, he moved with his parents from Egypt to China. Initially, he attended an English preschool before transferring to a Chinese preschool, where he experienced communication problems due to differences in culture and language. Upon finishing preschool, Szcześniak and his family moved to Warsaw in 1996,[5] where he experienced little to no difficulties in school while simultaneously developing his bilingualism from his early years. In an interview with Metro Warszawa, Szcześniak stated that he spoke English with his mother and sister and that he spoke in Polish with his father.[6] He listened to various rap artists with his father, developing his passion for the rap genre.[6] His parents divorced in 2004.[6]",
      "id": 4
    }
  ]
}